Repository: Zhangsfish/lecture-asset
Catalog: App/Localizable.xcstrings
Source language: en
Languages: zh_hans

# app.title
source: Lecture Asset
zh_hans: 讲座照片整理

# permission.title
source: Full photo access required
zh_hans: 需要完整照片权限

# permission.explanation
source: Allow full access to select and later clean up this batch.
zh_hans: 允许完整访问，用于选择和清理本批照片。

# permission.allow
source: Allow full access
zh_hans: 允许完整访问

# permission.blocked
source: Enable Full Access in Settings to continue.
zh_hans: 请在设置中开启完整访问。

# permission.restricted
source: Photo access is restricted on this device. Check device or family restrictions.
zh_hans: 这台设备限制了照片访问。请检查设备或家庭限制。

# permission.settings
source: Open Settings
zh_hans: 打开设置

# selection.selected
source: Selected
zh_hans: 已选择

# selection.hint
source: Tap to select; press and drag to sweep, up to 200 photos.
zh_hans: 点按选择；长按并滑动可连续选择，最多 200 张

# selection.unselected
source: Not selected
zh_hans: 未选择

# selection.confirm
source: Next: Review photos
zh_hans: 下一步：检查照片

# selection.limit
source: Maximum 200 photos
zh_hans: 最多选择 200 张

# confirm.title
source: Review selection
zh_hans: 检查已选照片

# confirm.instructions
source: Capture-time order. Tap to remove a mistake.
zh_hans: 按拍摄时间排序，点按移除误选

# confirm.remove
source: Remove selected photo
zh_hans: 移除已选照片

# confirm.start
source: Start Processing
zh_hans: 开始整理

# confirm.startFailed
source: Could not start. Check full Photos access and available storage.
zh_hans: 无法开始。请检查完整照片权限和可用存储空间。

# common.ok
source: OK
zh_hans: 好

# common.done
source: Done
zh_hans: 完成

# processing.title
source: Processing photos
zh_hans: 整理照片

# processing.active
source: Processing
zh_hans: 处理中

# processing.paused
source: Paused
zh_hans: 已暂停

# processing.failed
source: Page failed
zh_hans: 单页处理失败

# processing.completed
source: Photos prepared
zh_hans: 照片已整理

# processing.current
source: Page
zh_hans: 当前页

# processing.page
source: Page
zh_hans: 第

# processing.liveStill
source: Live Photo still
zh_hans: 实况照片静态图

# processing.pause
source: Pause after this page
zh_hans: 处理完本页后暂停

# processing.pausePending
source: Pause requested
zh_hans: 即将暂停

# processing.resume
source: Resume
zh_hans: 继续处理

# processing.retry
source: Retry this page
zh_hans: 重试本页

# processing.removeFailed
source: Remove failed page from job
zh_hans: 从任务移除失败页

# processing.removeConfirm
source: Remove this page from the job? The photo stays in Photos.
zh_hans: 从本次任务移除此页？相册中的照片不会被删除。

# processing.notDownloaded
source: Full-quality photo is not on this iPhone. Download it in Photos, then retry.
zh_hans: 这台 iPhone 上没有全质量照片。请先在“照片”中下载，再重试。

# processing.permissionLost
source: Full Photos access was lost. Restore it in Settings, then retry.
zh_hans: 完整照片权限已失效。请在设置中恢复后重试。

# processing.assetUnavailable
source: This photo is no longer available in Photos.
zh_hans: 这张照片已无法从相册获取。

# processing.degraded
source: Photos returned a preview instead of full quality. Retry after downloading the original.
zh_hans: 照片系统仅返回预览，未返回全质量图片。请下载原图后重试。

# processing.checkpointInvalid
source: A saved photo page failed verification. Retry this page; no photo was deleted.
zh_hans: 已保存的照片页面未通过校验。请重试本页；相册照片未被删除。

# processing.pageFailed
source: Could not create this full-quality JPEG. Retry; no page was skipped.
zh_hans: 无法生成本页全质量 JPEG。请重试；没有跳过此页。

# processing.storageFailed
source: Could not save or restore the job checkpoint. Check device storage before continuing.
zh_hans: 无法保存或恢复任务检查点。继续前请检查设备存储空间。

# processing.retryCheckpoint
source: Retry saving checkpoint
zh_hans: 重试保存检查点

# processing.completeDetail
source: Next, generate ZIP and PDF.
zh_hans: 下一步生成 ZIP 和 PDF

# processing.copyMetrics
source: Copy safe page measurements
zh_hans: 复制安全的页面测量数据

# processing.copied
source: Measurements copied
zh_hans: 测量数据已复制

# processing.preview
source: Inspect JPEG
zh_hans: 检查 JPEG

# processing.jpegCount
source: JPEG files
zh_hans: JPEG 文件

# processing.motionCount
source: MOV/audio files
zh_hans: MOV/音频文件

source: Archive paused
zh_hans: 归档已暂停

source: Archive failed
zh_hans: 归档失败

# archive.previewPDF
source: View PDF
zh_hans: 查看 PDF

# archive.retry
source: Retry archive
zh_hans: 重试归档

# archive.ready
source: Files ready
zh_hans: 文件已生成

# archive.processing
source: Building archive
zh_hans: 正在生成归档

# archive.readyDetail
source: Save the ZIP before cleaning up.
zh_hans: 保存 ZIP 后再清理

# archive.copyFailure
source: Copy safe failure diagnostics
zh_hans: 复制安全的失败诊断

# archive.copyMetrics
source: Copy safe archive measurements
zh_hans: 复制安全的归档测量数据

# archive.start
source: Generate ZIP and PDF
zh_hans: 生成 ZIP + PDF

# archive.resume
source: Resume archive
zh_hans: 继续归档

# archive.failedDetail
source: The archive was not marked ready. Check storage, then retry. Photos are unchanged.
zh_hans: 归档未标记为就绪。请检查存储空间后重试；相册照片未被修改。

# export.shareZIP
source: Save AI ZIP
zh_hans: 保存 AI 资料包（ZIP）

# export.sharePDF
source: Share PDF
zh_hans: 分享 PDF

# export.copyZIPHash
source: Copy ZIP SHA-256 for checking the received file
zh_hans: 复制 ZIP SHA-256 以核对收到的文件

# export.shareCompleted
source: The selected app reported that ZIP sharing completed. Check the complete ZIP at its destination before confirming.
zh_hans: 系统报告 ZIP 分享完成。确认前，请在接收位置检查完整 ZIP。

# export.confirmSaved
source: I have confirmed the complete ZIP is saved
zh_hans: 我已确认 ZIP 保存成功

# export.savedConfirmed
source: You confirmed the complete ZIP is saved externally.
zh_hans: 你已确认完整 ZIP 保存到了外部。

# export.saveConfirmTitle
source: Have you checked the complete AI ZIP at its destination?
zh_hans: 你已在接收位置检查完整的 AI ZIP 吗？

# export.saveConfirmAction
source: I have saved the complete AI ZIP
zh_hans: 我已保存完整的 AI ZIP

# export.deleteSources
source: Delete these source photos
zh_hans: 删除这批原照片

# export.cleanupLockedHint
source: Deleting photos stays locked until the complete ZIP is shared, you confirm its external save, and the archive and exact photos pass validation.
zh_hans: 完整 ZIP 分享成功、你确认外部保存，且归档和精确照片集合重新校验通过后，才能删除原照片。

# export.deleteConfirmTitle
source: Delete these exact source photos now?
zh_hans: 现在删除本次精确对应的原照片吗？

# export.deleteConfirmAction
source: Continue to Photos deletion confirmation
zh_hans: 继续至系统照片删除确认

# export.deleteConfirmCount
source: Source photo count:
zh_hans: 原照片数量：

# export.deleteLiveWarning
source: Live Photos among them: their motion and sound are not archived. Count:
zh_hans: 其中 Live Photo 的动态与声音没有归档。数量：

# export.deleteICloudWarning
source: If iCloud Photos is on, deletion may sync to your other devices. Photos will show its own deletion confirmation. Recently Deleted is not emptied here.
zh_hans: 如果已开启 iCloud 照片，删除可能同步到其他设备。系统会再次询问是否删除；本 App 不会清空“最近删除”。

# export.discardWorkCopy
source: Keep Photos, Clear App Files
zh_hans: 保留相册照片，仅清除 App 内文件

# export.discardConfirmTitle
source: Discard this App work copy?
zh_hans: 确定删除本次 App 工作副本吗？

# export.discardConfirmAction
source: Discard App files only
zh_hans: 只删除 App 文件

# export.discardDetail
source: Clear this job’s local JPEG, ZIP, PDF, OCR and recovery files. Anything not saved externally cannot be recovered from the App. Photos originals are kept.
zh_hans: 将清除本次 App 内的 JPEG、ZIP、PDF、OCR 和恢复文件。未保存到外部的文件将无法从 App 找回。相册原照片全部保留。

# export.photosDeletedCleanupPending
source: Photos deletion succeeded. App work-file cleanup is pending; do not request Photos deletion again.
zh_hans: 相册删除已成功，App 工作文件仍待清理；不会再次请求删除相册。

# export.retryPurge
source: Retry App file cleanup
zh_hans: 重试清理 App 文件

# export.errorArchiveChanged
source: The archive changed or failed validation. ZIP sharing and delete confirmation were reset.
zh_hans: 归档已变化或校验失败，ZIP 分享状态和删除确认已重置。

# export.errorShareIncomplete
source: ZIP sharing was cancelled or failed. Source photos remain unchanged.
zh_hans: ZIP 分享已取消或失败，原照片未改变。

# export.errorPermission
source: Full Photos Read & Write access is required. Restore access in Settings; App files are retained.
zh_hans: 需要完整的照片读取与写入权限。请在设置中恢复；App 文件已保留。

# export.errorLedger
source: The frozen source-photo list is invalid. Deletion was not started; App files are retained.
zh_hans: 冻结的原照片清单无效。未开始删除，App 文件已保留。

# export.errorMissing
source: A frozen source photo is missing or duplicated. Deletion was not started; App files are retained.
zh_hans: 有原照片缺失或重复。未开始删除，App 文件已保留。

# export.errorDelete
source: Photos deletion was cancelled or failed. App files are retained; you may retry.
zh_hans: 相册删除已取消或失败。App 文件已保留，可重试。

# export.busy
source: Checking archive and Photos…
zh_hans: 正在核对归档和相册…

# export.errorPurge
source: Photos deletion succeeded, but App file cleanup failed. Retry App cleanup; do not delete Photos again.
zh_hans: 相册删除已成功，但 App 文件清理失败。请重试清理 App 文件，不要再次删除相册。

# about.title
source: About & Support
zh_hans: 关于与支持

# about.usageTitle
source: How to use
zh_hans: 使用说明

# about.select
source: Select 1–200 photos. Tap or sweep across the grid.
zh_hans: 选 1–200 张照片；可点选或在网格中连续扫选。

# about.review
source: Review capture-time order and remove mistaken selections.
zh_hans: 按拍摄时间检查页序，移除误选照片。

# about.process
source: Organize photos, then choose to create the AI ZIP and PDF.
zh_hans: 先整理照片，再主动生成 AI 资料包和 PDF。

# about.save
source: Save and inspect the ZIP. Confirm it is stored elsewhere before optional photo cleanup.
zh_hans: 保存并检查 ZIP，确认外部保存后才可选择清理原照片。

# about.privacyTitle
source: Privacy
zh_hans: 隐私说明

# about.privacyLocal
source: Photos, text recognition and file creation stay on this iPhone. The developer does not automatically receive your photos or text.
zh_hans: 照片、文字识别和文件生成在本机完成；开发者不会自动收到你的照片或文字。

# about.privacyShare
source: Sharing, email and the external homepage open only when you choose them. Their receiving services have separate privacy policies; no photos, OCR or diagnostics are attached to support emails.
zh_hans: 分享、邮件和外部主页只在你主动点击时打开，接收方有自己的隐私政策；支持邮件不会自动附加照片、OCR 或诊断。

# about.privacyDelete
source: Photo deletion needs a verified ZIP, reported share completion, your external-save confirmation, a fresh delete action and system confirmation. App-only cleanup keeps Photos but removes unsaved work. Recently Deleted is never emptied by this App.
zh_hans: 删除原照片需要 ZIP 校验、分享完成、外部保存确认、单独删除操作和系统确认。仅清除 App 文件会保留相册原件，但丢失未保存的工作文件。App 不清空“最近删除”。

# about.privacyLive
source: Live Photos are archived as still JPEGs only. Motion and sound are not kept; deleting the source removes the whole Live Photo.
zh_hans: Live Photo 仅归档静态 JPEG，不保存动态和声音；删除原照片会删除整张 Live Photo。

# about.versionTitle
source: Version
zh_hans: 版本

# archive.processingDetail
source: Recognizing text and creating files on this iPhone.
zh_hans: 正在本机识别文字并生成文件。

# archive.technicalDetails
source: Technical details
zh_hans: 技术详情

# export.workCopySection
source: App work copy
zh_hans: 本次 App 工作副本

# export.workCopyHint
source: Optional: discard this job's local files and recovery state while keeping all Photos originals.
zh_hans: 可选：仅清理本次任务的本地文件及恢复状态，相册原照片保留。

# about.contactTitle
source: Contact
zh_hans: 反馈与联系

# about.copyEmail
source: Copy email
zh_hans: 复制邮箱

# about.emailCopied
source: Email copied
zh_hans: 邮箱已复制

# about.homepage
source: Personal homepage ↗
zh_hans: 个人主页 ↗

# tutorial.title
source: How to use
zh_hans: 使用教程

# tutorial.select
source: Press and drag to select
zh_hans: 长按滑动选择

# tutorial.order
source: Capture-time order
zh_hans: 自动排序

# tutorial.generate
source: Generate ZIP + PDF
zh_hans: 生成 ZIP + PDF

# tutorial.clean
source: Save, then clean up
zh_hans: 保存后再清理

# tutorial.previous
source: Back
zh_hans: 上一步

# tutorial.next
source: Next
zh_hans: 下一步

# tutorial.skip
source: Skip
zh_hans: 跳过

# tutorial.replay
source: Replay tutorial
zh_hans: 重播教程

# tutorial.generateAction
source: Tap Generate files
zh_hans: 点按生成文件

# tutorial.saved
source: Confirm ZIP saved
zh_hans: 确认 ZIP 已保存

# tutorial.deletePhotos
source: Delete this batch of Photos
zh_hans: 删除这批原照片

# tutorial.keepPhotos
source: Keep Photos, clear App files
zh_hans: 保留照片，清除 App 文件

# tutorial.selectVoice
source: Briefly press a photo, hold, then drag across the grid to select continuously. You can also tap to select. Up to 200 photos.
zh_hans: 先短暂按住一张照片，再滑动连续选择；也可以点按选择，最多 200 张。

# tutorial.orderVoice
source: Pages sort by capture time. Review the selection and tap a mistake to remove it.
zh_hans: 照片按拍摄时间排序。检查选择，点按移除误选。

# tutorial.generateVoice
source: After photos are prepared, tap Generate ZIP and PDF to start file generation.
zh_hans: 照片整理完成后，主动点按生成 ZIP 和 PDF。

# tutorial.cleanVoice
source: Save the ZIP and confirm it is saved externally before source cleanup. Choose Delete Photos, or Keep Photos and clear only App files. Each needs separate confirmation.
zh_hans: 先保存 ZIP 并确认外部文件完整，再选择删除原照片，或保留相册照片只清除 App 文件。两种清理都需要单独确认。

# help.selection
source: Select 1–200 photos. Tap to select; briefly press, then drag to sweep.
zh_hans: 选择 1–200 张照片。点按选择；短暂长按后滑动可连续选择。

# tutorial.ai
source: Hand it to AI
zh_hans: 交给 AI

# tutorial.aiVoice
source: A saved AI ZIP can be shared to an AI conversation. Ask it to summarize, organize or continue working with the lecture. This is a local teaching illustration, not a real share or AI response.
zh_hans: 保存后的 AI ZIP 可以分享给 AI，并继续让它总结、整理或处理讲座内容。这是本地教学示意，不会真实分享或调用 AI。

# tutorial.aiPrompt
source: Summarize this lecture
zh_hans: 概括这场讲座

# tutorial.aiResult
source: Lecture highlights
zh_hans: 讲座重点

# tutorial.hold
source: Hold
zh_hans: 按住

# tutorial.files
source: Files
zh_hans: 文件

# tutorial.confirmSaved
source: Confirm saved
zh_hans: 确认已保存

# tutorial.example
source: Example
zh_hans: 示例
